[
  {
    "title": "Hollywood superstar De Armas flies in to play 'random' role in Australian Open",
    "description": "Hollywood superstar Ana de Armas found herself pla...",
    "content": "Hollywood superstar Ana de Armas found herself playing a major role at the Australian Open as she introduced the trophy to the crowd before it was later claimed by champion Jannik Sinner.\n\nDe Armas jetted in to play her role alongside Jim Courier, who was a two-time winner in Melbourne, at the Rod Laver Arena. The Cuban-Spanish actress' involvement certainly came as a surprise as she walked out to help present the Norman Brookes Challenge Cup, which was produced from a Louis Vuitton box.\n\nAfter De Armas and Courier took the trophy to the middle of the court the crowd were treated to a Moulin Rouge musical number as part of the pre-match entertainment before Sinner and Daniil Medvedev walked out to contest the final.\n\nThere were a host of celebrities sitting inside Rod Laver Arena which included Australian Prime Minister Anthony Albanese, Australian actor Eric Bana and former All Blacks fly-half Dan Carter. They were treated to a sensational five-set affair which ended with the Italian lifting the trophy.\n\nSinner had beaten Novak Djokovic with a stunning display in the semi-final on Friday night, but was up against a man in Medvedev who has already won a Grand Slam and was now appearing in his third Australian Open. The Russian raced into a two-set lead and looked good value for his victory.\n\nThe Italian produced a magic comeback though that ended with him claiming a 3-6 3-6 6-4 6-4 6-3 success. \"It feels great. I just have to process it, I guess, how it feels the first time,\" Sinner told Australia's Channel Nine. \"It has been a hell of a journey even if I'm still only 22.\"\n\nSinner has been threatening this success for several seasons during his rapid rise. He made the ATP Finals at the back end of last year, losing to Djokovic, and had also made it to at least the quarter-finals in four of his last eight Grand Slam appearances.\n\nJannik Sinner emerged victorious in the final\n\nMedvedev has now suffered a second Australian Open final defeat when being two sets up. The Russian led Rafael Nadal by two sets back in 2022 before the Spaniard enjoyed a memorable comeback to break Medvedev's resolve.\n\nHe said after his latest defeat: \"I want to thank my team supporting me every day and every night. Dasha [his wife] and [daughter] Alisa if you are watching I am sorry I couldn't make it today but I am going to try next time for you.\n\n\"Just want to thank everyone it's been an amazing two weeks. It hurts to lose in the final but being in the final is better than losing before. I'm proud of myself and I'm going to try even harder next time.\"",
    "publishedDate": "2024-01-28T20:52:42",
    "language_id": 16,
    "isInternal": false,
    "ProcessedForIdentity": false,
    "writer_id": null,
    "entities": [
      "Ana de Armas",
      "Jannik Sinner",
      "Jim Courier",
      "Norman Brookes Challenge Cup",
      "Louis Vuitton",
      "Moulin Rouge",
      "Daniil Medvedev",
      "Novak Djokovic",
      "Australian Prime Minister Anthony Albanese",
      "Eric Bana",
      "Dan Carter",
      "Rafael Nadal",
      "ATP Finals"
    ],
    "locations": [
      "Melbourne",
      "Victoria",
      "Australia"
    ],
    "categories": [
      "Art & Entertainment"
    ],
    "media_urls": [
      "https://i2-prod.mirror.co.uk/incoming/article31988565.ece/ALTERNATES/s1200/0_Hollywood-superstar-Ana-de-Armas-flies-in-to-play-random-role-in-Australian-Open-final.jpg"
    ],
    "newsCorporationID": 14,
    "externalLink": "https://www.mirror.co.uk/sport/tennis/hollywood-superstar-ana-de-armas-31988511"
  },
  {
    "title": "Only Fools and Horses star David Jason eyeing up major role in a Hollywood movie",
    "description": "David Jason has recently filmed a BBC Two series w...",
    "content": "David Jason has recently filmed a BBC Two series with The Repair Shop's Jay Blades called the Touring Toolshed\n\nTV legend Sir David Jason is still dreaming of his big break in Hollywood at the age of 83.\n\nThe Only Fools and Horses star says while he has no regrets about how his own acting storyline has panned out, there is one gig he really craves. Reflecting on his illustrious body of work, Sir David said: \"I try not to look back too much. The past is a foreign country, they do things differently there, but I couldn't be happier with how my career has turned out.\n\n\"One of my ambitions is to be part of a major movie, as that would complete my dream of a Hollywood experience. Any producers out there?\"\n\nSir David, who turns 84 on Friday, has not seen his on-screen Trotter brother Nicholas Lyndhurst in the recent reboot of the US comedy Frasier but added: \"I'm sure he will have done a great job.\"\n\nJason is still dreaming of his next role 43 years after Only Fools and Horses first aired\n\nThe Del Boy actor has recently filmed a BBC Two series with The Repair Shop's Jay Blades called the Touring Toolshed. And he told the Sunday Times he loves little more than to escape to his shed in Buckinghamshire for a spot of tinkering.\n\nHe said of Jay: \"We're on the same page when it comes to repairs, restoration and all things creative. When I used to restore motorbikes I'd spend an awful lot of time in my shed polishing and fixing. I have a Fifties pinball machine that needs restoring, so that will be my next project.\"\n\nSir David said he likes the peace and solitude of fixing things and sees it as a legacy of the 'waste not, want not' generation. Born in Edmonton, North London, he trained as an electrician but gave it up to pursue acting after six years.\n\nAfter his first TV role in the ITV soap Crossroads in 1964, he made his name in 1976 alongside Ronnie Barker in Open All Hours, but is best known for playing Del Boy in John Sullivan's beloved BBC comedy. He has also starred in The Darling Buds of May and A Touch of Frost.",
    "publishedDate": "2024-01-28T20:54:27",
    "language_id": 16,
    "isInternal": false,
    "ProcessedForIdentity": false,
    "writer_id": null,
    "entities": [
      "David Jason",
      "Only Fools and Horses",
      "Hollywood",
      "BBC Two",
      "The Repair Shop",
      "Jay Blades",
      "Touring Toolshed",
      "TV legend",
      "acting",
      "career",
      "movie",
      "producers"
    ],
    "locations": [],
    "categories": [
      "Art & Entertainment"
    ],
    "media_urls": [
      "https://i2-prod.mirror.co.uk/incoming/article31988108.ece/ALTERNATES/s1200/0_436509David-Jays-Touring-Toolshed.jpg"
    ],
    "newsCorporationID": 14,
    "externalLink": "https://www.mirror.co.uk/3am/celebrity-news/only-fools-horses-star-david-31988096"
  },
  {
    "title": "Customers rage as Paramount+ crashes during crucial game",
    "description": "We'll be bringing you the very latest updates, pic...",
    "content": "We'll be bringing you the very latest updates, pictures and video on this breaking news story\n\nParamount Plus customers are fuming online as the streaming service appears to be down during a crucial football game between the Chiefs and the Ravens.\n\nThe malfunction seems to be hitting the East coast the hardest with some California residents experiencing outages as well, according to report map. Additionally, a few unlucky customers in middle America seem to be having issues with the platform too.\n\nWe'll be bringing you the very latest updates, pictures and videos on this breaking news story.\n\nPlease check back regularly for updates on this developing story HERE\n\nGet email updates on the day's biggest stories straight to your inbox by signing up for our newsletters .\n\nGet all the big headlines, pictures, analysis, opinion and videos on the stories that matter to you by following The Mirror every time you see our name.\n\nJoin The Mirror's WhatsApp Community - CLICK HERE\n\nFollow The Mirror on Google News - CLICK HERE and click the star\n\nFollow The Mirror on Apple News - CLICK HERE available on Apple devices\n\nFollow The Mirror on Flipboard - CLICK HERE and click follow\n\nYou can sign up for Twitter alerts for breaking news here @MirrorBreaking_ and follow us @DailyMirror , for all the latest updates.",
    "publishedDate": "2024-01-28T20:53:04",
    "language_id": 16,
    "isInternal": false,
    "ProcessedForIdentity": false,
    "writer_id": null,
    "entities": [
      "Paramount+",
      "streaming service",
      "football game",
      "Chiefs",
      "Ravens"
    ],
    "locations": [],
    "categories": [
      "Technology"
    ],
    "media_urls": [
      "https://i2-prod.mirror.co.uk/incoming/article24679929.ece/ALTERNATES/s1200/35_breaker.png"
    ],
    "newsCorporationID": 14,
    "externalLink": "https://www.mirror.co.uk/news/us-news/breaking-paramount-plus-down-customers-31988616"
  },
  {
    "title": "Trump says Melania will be 'active' by his side and shares Barron's real height",
    "description": "Melania Trump has seldom been seen with Donald Tru...",
    "content": "Melania Trump has seldom been seen with Donald Trump on his campaign trail\n\nDonald Trump has claimed his wife will be \"active\" by his side in 2024 - and he disclosed how tall his pampered son Barron really is.\n\nIn an interview, the ex-President disclosed the height of his 17-year-old son Barron as he claimed that his wife Melania will be \"active\" in his 2024 presidential campaign, despite her noticeable absence from his victory speech in New Hampshire. There have long been rumours the Slovenian-American former model is trying to distance herself from her husband and his many legal woes.\n\nIn an interview conducted Tuesday morning as voters began to gather at the polls for the New Hampshire primary, the former president said he looks to his first lady for guidance and commended her for her compassion. \"She wants to make America great again, too,\" he gushed.\n\n\"I rely on her for advice and all the others. I think she will be very active in the sense of being active.\" In addition, Trump said that he was worried about his family, who have been the subject of \"unfair\" insults ever since he took office and began his presidential campaign.\n\nREAD MORE: Inside Barron Trump's pampered life - from caviar moisturizer to home bowling alleys\n\nTrump said his family has endured \"unfair\" insults ever since he took office in 2016\n\n\"They did tremendous job in terms of economic development and jobs, every one of them,\" he said of his family. Speaking about Barron, he disclosed that he is 6 feet 8 inches tall. Last week, the teenager attended his grandmother Amalija Knavs' burial with his father. In addition, Trump disclosed during his Iowa caucus win speech that Barron's height is due to him eating all of his late grandmother's meals and that he prefers soccer to shooting hoops.\n\nWith Nikki Haley as his final opponent, Trump leads her by 20 points heading into the New Hampshire primary. He has a good chance of repeating his overwhelming triumph in Iowa and securing the Republican nominee for president.\n\nTrump is poised to grab the Republican nomination after his big wins in Iowa and New Hampshire\n\nSince Ron DeSantis announced his withdrawal on Sunday, Trump has arranged a forceful display of support and endorsements. At campaign rallies, he has invited past opponents, such as Tim Scott and Vivek Ramaswamy, to the platform as \"Avengers Assemble,\" according to a senior campaign assistant.\n\nFor all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US.\n\nEntering the Republican race, he now has the opportunity to duplicate his overwhelming victory in the Iowa caucus, defeat his last opponent, Haley, and secure the nomination. The GOP has aligned itself around Trump and declared him the one candidate capable of defeating Biden in 2024, while the other competitors have halted their campaigns.\n\nAccording to the polls, Trump is likely to defeat his last opponent, Nikki Haley, in South Carolina\n\nAccording to the most recent J.L. Partners poll, Trump has 57% of the vote against Haley's 37%. One day prior, Haley was only lagging by ten points and appeared to have a chance of winning provided Democrats and independents came out in support of her.\n\nIn the last day of the survey, which involved 851 respondents, Trump led Haley by 40 points among those questioned by J.L. Partners. She might find it difficult to narrow the deficit even if she witnesses a surge in support from undeclared voters of New Hampshire.\n\n\"Add in the fact Haley voters are lacking enthusiasm, and Trump looks set for a landslide victory. The whiff of inevitability now surrounds Donald Trump. If this poll is accurate, then the primary contest ends tonight,\" J.L. Partners co-founder James Johnson.",
    "publishedDate": "2024-01-28T20:45:21",
    "language_id": 16,
    "isInternal": false,
    "ProcessedForIdentity": false,
    "writer_id": null,
    "entities": [
      "Melania Trump",
      "Donald Trump",
      "Barron Trump"
    ],
    "locations": [
      "New Hampshire",
      "United States of America"
    ],
    "categories": [
      "Politics"
    ],
    "media_urls": [
      "https://i2-prod.mirror.co.uk/incoming/article31988505.ece/ALTERNATES/s1200/0_GettyImages-1228073166.jpg"
    ],
    "newsCorporationID": 14,
    "externalLink": "https://www.mirror.co.uk/news/us-news/trump-says-melania-active-side-31988283"
  },
  {
    "title": "Rylan gives update on mum Linda's health after 'nasty fall' with sweet video",
    "description": "Rylan Clark shares sweet video with mum Linda afte...",
    "content": "Rylan Clark shares sweet video with mum Linda after 'nasty fall'\n\nRylan has shared a hilarious clip with his mum following her \"tough year\".\n\nThe TV and radio presenter took to his social media where he gave his fans an update on how Linda is doing. It comes after she had to undergo surgery in September after \"quite a bad fall\" whilst on holiday in Spain with Rylan. Linda is believed to have broken her arm and her leg in the incident during her first trip abroad in ten years.\n\nRylan has since shared a clip of Linda enjoying his pool as she carried out her exercises for her leg. She had her music on full blast as Rylan commented: \"Just wanted a quiet Sunday.... Until Linda turns up 'FOR HER LEG' ..... sure.\" He saw the funny side as he shared the sweet moment with his followers.\n\nLinda did her workout in Rylan's pool His mum had a horror fall while on holiday in Spain and had to be flown back to the UK\n\nOne said: \"@Rylan love her and enjoy her all the time you have her, no one replaces our Mums... x.\" Another added: \"What's that pool for, if it's not for Linda to live her best life in!\" Someone else commented: \"You don't get a better friend than your mam xx.\" As a fourth wrote: \"What a legend love Linda be back on celebrity Gogglebox you both make the show so much fun.\"\n\nLinda - who has experienced other health issues - appeared to reference the incident on her son's BBC Radio 2 show at the start of the year. She was invited to give an end of year speech to listeners on the radio show where she was introduced by Rylan as the Duchess of Essex. She told listeners: \"Right everyone, you alright? It's been one hell of a year, ain't it Ross? Eurovision in Liverpool. The Lionesses coming so close. Becky Hill winning a Brit.\"\n\nSeemingly referencing her accident, she told Rylan, real name Ross: \"As you all know, it's been a tough year for me. I'd like to thank all the nurses, doctors, physiotherapists and pilot who have helped me get back on my feet. And of course you too, Ross.\" Linda - who's been on Celebrity Gogglebox with Rylan - concluded the speech by telling listeners: \"I hope 2024 is lovely for everyone listening. I'm off to Lakeside to get some new boots, as well as a ham and cheese toastie.\"\n\nAt the time of Linda's fall, Rylan hired private jets to fly his mum home from Marbella and pleaded with his followers to keep her in their prayers. Revealing details surrounding the incident back in September, the former X Factor star said: \"So unfortunately I took my mum away on her first holiday in a good few years and sadly she's had quite a bad fall, resulting in her having to have surgery out there.\n\nAfter his mum had her operation, he'd said he was thankful there'd been no complications. Rylan admitted it had been an \"absolute nightmare\" but Linda was on the road to recovery.\n\nFollow Mirror Celebs onTikTok,Snapchat,Instagram,Twitter,Facebook,YouTubeandThreads.",
    "publishedDate": "2024-01-28T20:51:55",
    "language_id": 16,
    "isInternal": false,
    "ProcessedForIdentity": false,
    "writer_id": null,
    "entities": [
      "Rylan Clark",
      "Linda",
      "Spain"
    ],
    "locations": [
      "United Kingdom"
    ],
    "categories": [
      "Lifestyle & Society"
    ],
    "media_urls": [
      "https://i2-prod.mirror.co.uk/incoming/article31988266.ece/ALTERNATES/s1200/0_JSR_MEN_100621_Rylan.jpg"
    ],
    "newsCorporationID": 14,
    "externalLink": "https://www.mirror.co.uk/3am/celebrity-news/rylan-clark-gives-update-mum-31988122"
  },
  {
    "title": "Dancing On Ice viewers spot show trend as they complain it 'makes no sense'",
    "description": "Dancing On Ice fans were left confused on Sunday n...",
    "content": "Dancing On Ice fans were left confused on Sunday night as they spotted a ITV skating show trend.\n\nThe hit skating series returned once again on Sunday night with Adele Roberts, Amber Davies, Claire Sweeney, Eddie the Eagle, Greg Rutherford, Hannah Spearritt, Lou Sanders, Miles Nazaire, Ricky Norwood, Roxy Shahidi and Ryan Thomas taking to the ice for Movie Week.\n\nThroughout the episode some of the stars did really well as others were at the bottom of the scoreboard. After Sunday night's Movie Week, the leaderboard was revealed as Amber, 27, at the top with professional partner Simon Proulx-Sénécal with a whopping 31 points while Hannah, 42, and professional partner Andy Buchanan were at the bottom with 20 points.\n\nBut not everyone agreed with the marking of some of the contestants. As the judges gave their scores and feedback, some viewers hit out at their decisions, claiming the scoring was \"all over the place\" and \"makes no sense\".\n\nDancing On Ice fans were left confused on Sunday night as they spotted a ITV skating show trend\n\nTaking to Twitter, now X, one person said: \"The scoring on #dancingonice makes no sense at all. Are the judges watching a different show than me?\", a different account put: \"The scoring is a joke #dancingonice\", another viewer wrote: \"The scoring seems to be a bit all over the place this week #dancingonice\" while a different fan added: \"This scoring makes no sense #DancingOnIce!\"\n\nElsewhere, one show watcher put: \"See the judges scoring is all over the place again #DancingOnIce\", a different account put: \"This scoring is a bit all over. #DancingOnIce\" while another added: \"Me trying to understand the scoring on this show. #dancingonice\" with confused emojis.\n\nIt comes as former boxer Ricky Hatton, 45, was the first to be eliminated alongside professional partner Robin Johnstone last weekend while Holly Willoughby is hosting the series, alongside new co-presenter Stephen Mulhern, who has replaced Phillip Schofield.\n\nHolly Willoughby is hosting the series, alongside new co-presenter Stephen Mulhern, who has replaced Phillip Schofield\n\nHolly has made a sensational return to television for Dancing On Ice after she had recently stepped back from the spotlight following her decision to leave This Morning in October after 14 years. Question marks over her future as host of Dancing On Ice remained until December 27, when ITV bosses finally confirmed she'd be back to front the programme alongside Stephen, 46.\n\nAs Holly and Stephen were officially unveiled as a new dream team, ITV's Head of Entertainment Commissioning, Katie Rawcliffe, gushed: \"Holly and Stephen are two of our best-loved presenters, so reuniting them twenty years after they first appeared on screen together to host Dancing on Ice marks the start of an exciting year for the show.\n\n\"Celebrating 20 years since they first worked together on Ministry of Mayhem, Willoughby and Mulhern will preside over the action on the high octane skating show as this year's celebrities compete to become champion of the ice. Judges Torvill and Dean, Ashley Banjo and Oti Mabuse are back on the panel.\"\n\nDancing On Ice returns next Sunday at 6:20pm on ITV and ITV X. Follow Mirror Celebs and TV on Snapchat , Instagram , Twitter , Facebook , YouTube and Threads .",
    "publishedDate": "2024-01-28T20:37:29",
    "language_id": 16,
    "isInternal": false,
    "ProcessedForIdentity": false,
    "writer_id": null,
    "entities": [
      "sleepers",
      "love"
    ],
    "locations": [],
    "categories": [
      "Art & Entertainment"
    ],
    "media_urls": [
      "https://i2-prod.mirror.co.uk/incoming/article31988282.ece/ALTERNATES/s1200/0_Screenshot-2024-01-28-at-193120.jpg"
    ],
    "newsCorporationID": 14,
    "externalLink": "https://www.mirror.co.uk/tv/tv-news/itv-dancing-ice-viewers-spot-31988238"
  },
  {
    "title": "Jeremy Renner details life one year after horrifying near-death snowplough crush",
    "description": "Jeremy Renner was crushed by a snowplough on Janua...",
    "content": "Jeremy Renner was crushed by a snowplough on January 1 last year\n\nJeremy Renner has opened up about his \"changed\" life one year after his horror near-fatal snowplough accident in 2023.\n\nThe Hawkeye actor broke over 30 bones when he was crushed by the vehicle on January 1 last year near his home in Reno, Nevada in Lake Tahoe. The 14,000lb snowplough left the Hollywood star with a collapsed lung and a pierced live from his shattered ribs.\n\nNow, just over one year since the terrifying ordeal, the 53-year-old has got candid about his life, admitting he feels more \"sensitive and youthful\" after the near-death experience. Jeremy explained he had \"a lot of callousness squashed out of me\".\n\nFor all the latest on news, politics, sports, and showbiz from the USA, go to The Mirror US.\n\nREAD MORE: Jeremy Renner details list of treatments he received after scary snowplough accident\n\nThe Hawkeye actor broke over 30 bones when he was crushed\n\n\"I've never been bitter but always maybe a little more callous, a little bit more tough,\" he told PEOPLE. And I just think those calluses are just scraped off me at this point. Literally, I feel pretty open and wonderfully sensitive and youthful. I've been blessed.\"\n\nAfter the crash, Jeremy spent weeks in hospital undergoing several operations as he slowly recovered from his catastrophic injuries. He made a miraculous return to the red carpet after months of recovery last April, crediting the reason for his fight back.\n\nHe told reporters his 10-year-old daughter Ava was his \"number one reason\" for recovery. \"Everything kind of just went right,\" he said. \"Obviously I had a lot of tenacity, I had a lot of support and a lot of reason to recover. That is really special,\" he continued. \"There's a lot of people that don't have as much -- those things to live for.\"\n\nLast November, Jeremy revealed the extensive list of treatments he has undergone since the accident. In an Instagram post he wrote: \"I have been exploring EVERY type of therapy since Jan 14th ... everyday, countless hours of physical therapy, peptide injections, iv drips and pushes, stem cell and exosomes, red light / IR therapy, hyperbaric chamber 2.0 atmospheres, cold plunge, and the list goes on and on.... BUT... My greatest therapy has been my mind and the will to be here and push to recover and be better.... Be exceptional... I feel it's my duty to do so.\n\n\"Not to squander my life being spared, but to give back to my family, friends, and all of you whom have empowered me to endure. I thank you all. #loveandtitanium.\" Last year he stressed that \"pain is progress\" as he battled through his injuries on the road to recovery. In another social media post, he penned: \"Lower pain levels mark great progress. Making recovery and surpassing goals. A daily habit!\"\n\nJeremy suffered significant injuries when he was accidentally run over while trying to help his nephew. A police report said Alexander Fries was trying to free his car from the snow when the plough began to roll down the hill. Jeremy was helped by his neighbours, who were trained doctors, and then air-lifted to hospital in Reno, Nevada, where he spent considerable time in an intensive care unit (ICU).\n\nKnown for the Marvel film The Avengers in which he plays the superhero archer Hawkeye, he has also starred in a Disney+ series of the same name as his character. Jeremy has also received Oscar nominations for his roles in war film The Hurt Locker and drama The Town.\n\nFollow Mirror Celebs on TikTok, Snapchat, Instagram, Twitter, Facebook, YouTube and Threads.",
    "publishedDate": "2024-01-28T20:29:15",
    "language_id": 16,
    "isInternal": false,
    "ProcessedForIdentity": false,
    "writer_id": null,
    "entities": [
      "Jeremy Renner",
      "snowplough accident",
      "life",
      "near-death experience"
    ],
    "locations": [
      "Reno",
      "Nevada",
      "United States of America"
    ],
    "categories": [
      "Art & Entertainment"
    ],
    "media_urls": [
      "https://i2-prod.mirror.co.uk/incoming/article31988106.ece/ALTERNATES/s1200/0_accident.jpg"
    ],
    "newsCorporationID": 14,
    "externalLink": "https://www.mirror.co.uk/3am/us-celebrity-news/jeremy-renner-details-life-one-31988095"
  },
  {
    "title": "Taylor Swift supports Travis Kelce as Kansas City Chiefs try to reach Super Bowl",
    "description": "Taylor Swift flew in to support her boyfriend, Tra...",
    "content": "Taylor Swift flew in to support her boyfriend, Travis Kelce, and his team, the Kansas City Chiefs, as they faced off against the Baltimore Ravens in the NFC Championship game.\n\nThe pop superstar, who has been dating Kelce since last September, has become a regular fixture at his games and seems to bring good luck, with the Chiefs winning eight out of the 11 games she's attended. With just one more win needed to reach the Super Bowl, she made the effort to fly to Baltimore to show her support yet again.\n\nSwift joined Kelce's family for the match, after his brother Jason stole the show last week with his shirtless antics in the freezing cold against the Buffalo Bills. Swift was pictured arriving at the stadium alongside Brittany Mahomes, wife of Chiefs quarterback Patrick, after arriving in Baltimore on her private jet earlier in the day.\n\nREAD MORE:Full list of NFL Playoffs on DAZN and how to watch all games and Super Bowl LVIII for £20\n\nREAD MORE: Will Taylor Swift be at the Super Bowl? Eras Tour schedule and NFL finale date\n\nDespite being the underdogs for the second week running, the Chiefs are hopeful about their chances of retaining the Super Bowl title. Ahead of the game, Kelce said: \"I ain't thinking about a single one I did, I already accomplished. I'm thinking about this one on Sunday and I want it more than I've ever wanted one in my life.\"\n\nKelce, who scored twice for Kansas City against the Buffalo Bills, added: \"There's nothing like playoff football. You could feel that energy the week before against Miami at Arrowhead.\n\n\"It doesn't matter who you are, where you play, if you rally together with the men and women that you've got and the team that you've got, like I said you can play anywhere you want to. You got to bring that juice no matter who's in the crowd.\"\n\nTaylor Swift being at Sunday's game got people talking a lot, just with every game she has attended. But Kelce says he and Swift just ignore what others say about them. \"It's just the outside noise and dealing with everyone else's perspective of things,\" he explained.\n\nTaylor Swift sported a new hair style as she arrived to support her boyfriend Travis Kelce\n\n\"You hear it through the media throughout the season when I haven't had success or things aren't going well that perhaps we aren't focused, but if you're in this building, you know what's going on.\"\n\n\"So you've got to compartmentalize what you're hearing and make sure you're staying on task and giving everybody in the building and on that team the right perception.\"\n\nIf the Chiefs beat Baltimore, they'll play either the San Francisco 49ers or the Detroit Lions next month in Las Vegas to try and lift the Vince Lombardi Trophy.\n\n* An AI tool was used to add an extra layer to the editing process for this story. You can report any errors to webhomepage@mirror.co.uk",
    "publishedDate": "2024-01-28T20:35:59",
    "language_id": 16,
    "isInternal": false,
    "ProcessedForIdentity": false,
    "writer_id": null,
    "entities": [
      "Taylor Swift",
      "Travis Kelce",
      "Kansas City Chiefs",
      "Baltimore Ravens",
      "Super Bowl"
    ],
    "locations": [
      "Maryland",
      "United States of America"
    ],
    "categories": [
      "Sports"
    ],
    "media_urls": [
      "https://i2-prod.mirror.co.uk/news/uk-news/article31988431.ece/ALTERNATES/s1200/0_gettyimages-1961118884.jpg"
    ],
    "newsCorporationID": 14,
    "externalLink": "https://www.mirror.co.uk/sport/other-sports/american-sports/taylor-swift-nfl-travis-kelce-31988432"
  },
  {
    "title": "Travis Kelce involved in pre-game spat as he throws helmet and kicks ball away",
    "description": "Travis Kelce threw Justin Tucker's balls and helme...",
    "content": "Travis Kelce threw Justin Tucker's balls and helmet away to help Patrick Mahomes practice\n\nTravis Kelce was seen kicking away a ball and tossing the helmet of Baltimore Ravens kicker Justin Tucker during a pre-game spat. The incident happened before the AFC Championship Game, where he wanted to make sure his Kansas City Chiefs teammate, Patrick Mahomes, could practice properly.\n\nDespite dating pop sensation Taylor Swift, Kelce remains focused on his game. He played brilliantly in the Divisional Round of the NFL playoffs last week, scoring two key touchdowns and leading his team in receiving yards.\n\nThe Chiefs won against the Buffalo Bills, securing their place against the top-seeded Ravens. As the big game approached, the atmosphere was heating up.\n\nDuring warm-ups at M&T Bank Stadium, Kelce wasn't happy with where Tucker chose to warm up. So, the 34-year-old took action, kicking away Tucker's ball and throwing his helmet aside to ensure Mahomes could practice effectively.\n\nREAD MORE:Full list of NFL Playoffs on DAZN and how to watch all games and Super Bowl LVIII for £20\n\nREAD MORE: Will Taylor Swift be at the Super Bowl? Eras Tour schedule and NFL finale date\n\nKansas City Chiefs have again taken the spotlight in the AFC Championship, marking their sixth consecutive appearance with star player Mahomes playing a significant role each time.\n\nThe face-off between Jackson's Ravens and Mahomes' Chiefs has already played out on four occasions, with the Chiefs leading the score at 3-1. After earlier losses, Jackson called the AFC West franchise his 'kryptonite', but he turned things around, leading his team to an astounding 36-35 win in week 2 of the 2021 season.\n\nDespite that victory, Jackson was dreading facing Mahomes once more. He said ahead of the game: \"I don't like competing with him at all.\" Yet, like any true sportsman, he went on to say: \"To be a champion, you've got to go through a champion.\"\n\nWhoever secures the AFC Championship title will face either the Detroit Lions or San Francisco 49ers it's anyone's guess who'll make Super Bowl LVIII.\n\n* An AI tool was used to add an extra layer to the editing process for this story. You can report any errors to webhomepage@mirror.co.uk",
    "publishedDate": "2024-01-28T20:26:54",
    "language_id": 16,
    "isInternal": false,
    "ProcessedForIdentity": false,
    "writer_id": null,
    "entities": [
      "Travis Kelce",
      "Justin Tucker",
      "Patrick Mahomes",
      "Taylor Swift",
      "Kansas City Chiefs",
      "Baltimore Ravens",
      "Buffalo Bills",
      "M&T Bank Stadium",
      "AFC Championship Game",
      "NFL playoffs",
      "Super Bowl LVIII",
      "NFL",
      "Divisional Round",
      "AFC West",
      "Jackson",
      "Detroit Lions",
      "San Francisco 49ers",
      "Super Bowl"
    ],
    "locations": [
      "Baltimore",
      "Maryland",
      "United States of America"
    ],
    "categories": [
      "Sports"
    ],
    "media_urls": [
      "https://i2-prod.mirror.co.uk/news/uk-news/article31988440.ece/ALTERNATES/s1200/0_mirror-us-could-i-please-get-a-main-of-a-grab-of-kelce-thorwing-the-ball-away-with-an-inset-of-kel.jpg"
    ],
    "newsCorporationID": 14,
    "externalLink": "https://www.mirror.co.uk/sport/other-sports/american-sports/travis-kelce-justin-tucker-nfl-31988441"
  }
]